<center>Name:Quratulain<br>
Email:QuratulainAIML@hotmail.com<br>
Github:QuratulainAIML<br>
Title: Project Practices</center>

Python Pandas Data Analysis And cleaning

Step1:Import necessary library

In [1]:
#install pandas library
%pip install pandas

Requirement already satisfied: pandas in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
#install numpy library
%pip install numpy

Requirement already satisfied: numpy in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

Step2:Import libraries

In [3]:
#import pandas
import pandas as pd

In [4]:
#import numpy
import numpy as np

Step3: Load the CSV data into a Dataframe

In [5]:
#loading dataset
df=pd.read_csv('data.csv')
print("This is my CSV dataset")
df

This is my CSV dataset

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

Display first five rows of CSV Dataset

In [6]:
#Display first five rows of CSV Dataset
df.head()

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

step4: check null values

In [7]:
# check null values
print(df.isnull().sum())

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

step5: Fill missing values in the Salary column with the mean salary

In [8]:
# Fill missing values in the Salary column with the mean salary
ms=df['Salary'].mean()
df['Salary'].fillna(ms,inplace=True)

C:\Users\qurat\AppData\Local\Temp\ipykernel_11228\2486365635.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(ms,inplace=True)

Replace null values in salary with mean

In [9]:
mean_salary=df['Salary'].fillna(df['Salary'].mean())
print(mean_salary)

0     1.150000e+05
1     3.500000e+04
2     5.000000e+04
3     7.000000e+04
4     1.500000e+06
5     1.725333e+05
6     2.000000e+04
7     1.150000e+05
8     3.500000e+04
9     1.725333e+05
10    7.000000e+04
11    9.000000e+04
12    1.100000e+05
13    2.000000e+03
14    1.600000e+04
15    1.700000e+05
16    1.900000e+05
Name: Salary, dtype: float64

Check if the null value is replaced or not

In [10]:

df['Salary'].isnull().sum()

np.int64(0)

step6:Check null values in age column

In [11]:
df['Age'].isnull().sum()

np.int64(1)

replace null values in age with median

In [12]:
df['Age']=df['Age'].fillna(df['Age'].median())
print(df['Age'])

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11     30.0
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64

Check null values in Age column

In [13]:
df['Age'].isnull().sum()

np.int64(0)

In [14]:
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            0
Salary         0
dtype: int64

step 7: Correct any obvious data entry error in the 'Age column'

In [15]:
AgeMedian=df['Age'].median()
df['Age'].fillna(AgeMedian,inplace=True)
df['Age']=df['Age'].apply(lambda x: x if x<120 else AgeMedian)
df['Age'].isnull().sum()
df['Age']

C:\Users\qurat\AppData\Local\Temp\ipykernel_11228\2264594927.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(AgeMedian,inplace=True)

0     37.0
1     30.0
2     29.0
3     30.0
4     25.0
5     22.0
6     29.0
7     26.0
8     28.0
9     55.0
10    60.0
11    30.0
12    30.0
13    67.0
14    80.0
15    20.0
16    85.0
Name: Age, dtype: float64

Step8: Correct any obvious data entry error in the salary column

In [16]:
salarymean=df['Salary'].median()
df['Salary'].fillna(AgeMedian,inplace=True)
df['Salary']=df['Salary'].apply(lambda x: x if x<100000 else salarymean)
df['Salary'].isnull().sum()
df['Salary']

C:\Users\qurat\AppData\Local\Temp\ipykernel_11228\3900205010.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(AgeMedian,inplace=True)

0     90000.0
1     35000.0
2     50000.0
3     70000.0
4     90000.0
5     90000.0
6     20000.0
7     90000.0
8     35000.0
9     90000.0
10    70000.0
11    90000.0
12    90000.0
13     2000.0
14    16000.0
15    90000.0
16    90000.0
Name: Salary, dtype: float64

Step9: Change all initials from lower to uppercase in designation column

In [31]:
#remove all lower case initials
df['Designation']= df['Designation'].str.title()
df['Designation']

0     Professor
1       Teacher
2      Engineer
3       Analyst
4      Engineer
5     Scientist
6       Analyst
7     Scientist
8      Engineer
9       Teacher
10    Professor
11     Engineer
12      Trainer
13      Teacher
14      Trainer
15    Professor
16     Engineer
Name: Designation, dtype: object

Step10: Group by Designation and calaculate mean salary for each designation

In [30]:
# group by Designation and calculate its mean salary
salarybycheckingdesignation=df.groupby('Designation')['Salary'].mean()
salarybycheckingdesignation

Designation
Analyst      45000.000000
Engineer     71000.000000
Professor    83333.333333
Scientist    90000.000000
Teacher      42333.333333
Trainer      53000.000000
Name: Salary, dtype: float64

Step11: Group by Age and calaculate mean salary for each Age

In [ ]:
# group by age and calculate its mean salary
salarybycheckingage=df.groupby('Age')['Salary'].mean()
salarybycheckingage

Age
20.0    90000.0
22.0    90000.0
25.0    90000.0
26.0    90000.0
28.0    35000.0
29.0    35000.0
30.0    71250.0
37.0    90000.0
55.0    90000.0
60.0    70000.0
67.0     2000.0
80.0    16000.0
85.0    90000.0
Name: Salary, dtype: float64

Step12: Group by Designation and calaculate mean Age for each Designation

In [29]:
# group by Designation  and calculate mean age
salarybycheckingdesignation=df.groupby('Designation')['Age'].mean()
salarybycheckingdesignation

Designation
Analyst      29.500000
Engineer     39.400000
Professor    39.000000
Scientist    24.000000
Teacher      50.666667
Trainer      55.000000
Name: Age, dtype: float64

Step13: Print higher salary

In [27]:
#print salaries greater than 50000
hs=df[df['Salary']>50000]
print(hs)

             Name Designation Gender   Age   Salary
0         Mukhtar   Professor      M  37.0  90000.0
3   Naveed Fatima     Analyst      F  30.0  70000.0
4           Babar    Engineer      F  25.0  90000.0
5            Aqsa   Scientist      F  22.0  90000.0
7           Samra   Scientist      F  26.0  90000.0
9        Abdullah     Teacher      M  55.0  90000.0
10          Mosib   Professor      M  60.0  70000.0
11          Ahmed    Engineer      M  30.0  90000.0
12          Ahsan     Trainer      M  30.0  90000.0
15         Qaisar   Professor      M  20.0  90000.0
16          Wajid    Engineer      M  85.0  90000.0

Step 14: Sort the dataframe by age

In [22]:
#in Descending
sf=df.sort_values(by='Age',ascending=False)
print(sf)

             Name Designation Gender   Age   Salary
16          Wajid    Engineer      M  85.0  90000.0
14          Naeem     Trainer      M  80.0  16000.0
13          Wajid     Teacher      M  67.0   2000.0
10          Mosib   Professor      M  60.0  70000.0
9        Abdullah     Teacher      M  55.0  90000.0
0         Mukhtar   Professor      M  37.0  90000.0
1           Azziz     Teacher      M  30.0  35000.0
11          Ahmed    Engineer      M  30.0  90000.0
3   Naveed Fatima     Analyst      F  30.0  70000.0
12          Ahsan     Trainer      M  30.0  90000.0
2          Mohsin    Engineer      M  29.0  50000.0
6           Rafia     Analyst      F  29.0  20000.0
8            Eman    Engineer      F  28.0  35000.0
7           Samra   Scientist      F  26.0  90000.0
4           Babar    Engineer      F  25.0  90000.0
5            Aqsa   Scientist      F  22.0  90000.0
15         Qaisar   Professor      M  20.0  90000.0

In [23]:
#in ascending
sf=df.sort_values(by='Age',ascending=True)
print(sf)

             Name Designation Gender   Age   Salary
15         Qaisar   Professor      M  20.0  90000.0
5            Aqsa   Scientist      F  22.0  90000.0
4           Babar    Engineer      F  25.0  90000.0
7           Samra   Scientist      F  26.0  90000.0
8            Eman    Engineer      F  28.0  35000.0
2          Mohsin    Engineer      M  29.0  50000.0
6           Rafia     Analyst      F  29.0  20000.0
1           Azziz     Teacher      M  30.0  35000.0
12          Ahsan     Trainer      M  30.0  90000.0
3   Naveed Fatima     Analyst      F  30.0  70000.0
11          Ahmed    Engineer      M  30.0  90000.0
0         Mukhtar   Professor      M  37.0  90000.0
9        Abdullah     Teacher      M  55.0  90000.0
10          Mosib   Professor      M  60.0  70000.0
13          Wajid     Teacher      M  67.0   2000.0
14          Naeem     Trainer      M  80.0  16000.0
16          Wajid    Engineer      M  85.0  90000.0

Step15: Save the cleaned dataframe to  a new CSV File

In [26]:
# save changes into a new file
df.to_csv('Cleaned_data.csv',index=False)

In [25]:
df

             Name Designation Gender   Age   Salary
0         Mukhtar   Professor      M  37.0  90000.0
1           Azziz     Teacher      M  30.0  35000.0
2          Mohsin    Engineer      M  29.0  50000.0
3   Naveed Fatima     Analyst      F  30.0  70000.0
4           Babar    Engineer      F  25.0  90000.0
5            Aqsa   Scientist      F  22.0  90000.0
6           Rafia     Analyst      F  29.0  20000.0
7           Samra   Scientist      F  26.0  90000.0
8            Eman    Engineer      F  28.0  35000.0
9        Abdullah     Teacher      M  55.0  90000.0
10          Mosib   Professor      M  60.0  70000.0
11          Ahmed    Engineer      M  30.0  90000.0
12          Ahsan     Trainer      M  30.0  90000.0
13          Wajid     Teacher      M  67.0   2000.0
14          Naeem     Trainer      M  80.0  16000.0
15         Qaisar   Professor      M  20.0  90000.0
16          Wajid    Engineer      M  85.0  90000.0